b, q, n = map(int,input("Введите 3 значения 1. Первый элемент прогрессии 2. Множитель прогрессии 3. Номер последнего элемента: ").split())#ввод значения 
if -10000<=b and b<= 10000: #условие 
    if 1 < q and q <= 50: #условие
        if 2 <= n and n <= 100: #условие
            print ((b*(q**n-1))//(q-1)) #вычесление суммы прогрессии 
        else: print ("ошибка")#если условия невыполнены 
    elif q == 1:#если переменная равна 1 
            print(b*n)#фомула
    else: print ("ошибка")#если условия невыполнены
else: print ("ошибка")#если условия невыполнены